In [19]:
import pandas as pd

In [20]:

column_names = ['field1', 'field2', 'field3', 'field4', 'field5']
col = ['field3', 'field4', 'field5']
value = [['vaibhav', '34534', 'Chittorgarh'], ['jahnavi', '2345', 'Kota'], ['vini', '87654', 'Ahmedabad']]

df = pd.DataFrame(columns=column_names)

In [21]:
df

Empty DataFrame
Columns: [field1, field2, field3, field4, field5]
Index: []

In [27]:
df.loc[2, 'field3'] = "Kota"

In [28]:
df

  field1 field2       field3 field4 field5
1    NaN    NaN  CHITTorgarh    NaN    NaN
0    NaN    NaN    Ahmedabad    NaN    NaN
2    NaN    NaN         Kota    NaN    NaN

In [29]:
print(df)

  field1 field2       field3 field4 field5
1    NaN    NaN  CHITTorgarh    NaN    NaN
0    NaN    NaN    Ahmedabad    NaN    NaN
2    NaN    NaN         Kota    NaN    NaN

In [24]:
print(df)

  field1 field2       field3 field4 field5
1    NaN    NaN  CHITTorgarh    NaN    NaN